<?php

namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\ChapterLecture;

class ChapterLecturesSeeder extends Seeder
{
    public function run()
    {
        $chapters = [
            'অধ্যায় ২ : জৈব রসায়ন' => 22,
            'অধ্যায় ৪ : তড়িৎ রসায়ন' => 8,
            'অধ্যায় ২ : স্থির তড়িৎ' => 7,
            'অধ্যায় ৩ : চলতড়িৎ' => 8,
            'অধ্যায় ৪ : তড়িৎ চুম্বকত্ব' => 8,
            'অধ্যায় ৭ : ভৌত আলোকবিজ্ঞান' => 6,
            'অধ্যায় ৮ : আধুনিক পদার্থবিজ্ঞানের সূচনা' => 5,
            'অধ্যায় ৩ : জটিল সংখ্যা' => 4,
            'অধ্যায় ৪ : বহুপদী ও বহুপদী সমীকরণ' => 4,
            'অধ্যায় ৫ : দ্বিপদী বিস্তৃতি' => 7,
            'অধ্যায় ৬ : কণিক' => 8,
            'অধ্যায় ৭ : বিপরীত ত্রিকোণমিতিক ফাংশন ও ত্রিকোণমিতিক সমীকরণ' => 3,
            'অধ্যায় ৫ : শ্বাসক্রিয়া ও শ্বসন' => 4,
            'অধ্যায় ৬ : বর্জ্য ও নিষ্কাশন' => 3,
            'অধ্যায় ৭ : চলন ও অঙ্গচালনা' => 5,
            'অধ্যায় ৮ : সমন্বয় ও নিয়ন্ত্রণ' => 7,
            'অধ্যায় ৯ : মানব জীবনের ধারাবাহিকতা' => 7,
            'অধ্যায় ১০ : মানবদেহের প্রতিরক্ষা' => 4,
            'অধ্যায় ১১ : জীনতত্ত্ব ও বিবর্তন' => 6,
        ];

        foreach ($chapters as $chapter => $lectures) {
            for ($i = 1; $i <= $lectures; $i++) {
                ChapterLecture::create([
                    'chapter' => $chapter,
                    'lecture_number' => $i,
                    'lecture_link' => "$chapter Lecture $i",
                ]);
            }
        }
    }
}
